Revit 2027 API
Wall.RemoveProfileSketch Method
 Reverts an edited wall to its original shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveProfileSketch()
Public Sub RemoveProfileSketch
public:
void RemoveProfileSketch()
member RemoveProfileSketch : unit -> unit
Remarks
 The wall profile is changed back to its original rectangular profile. All profile changes made in the sketch mode are discarded. To check if wall sketch can be removed call SketchId.
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace